Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: བསྡིགས་ཤིང་བརྡེགས་ཀྱང་གཟུགས་བརྙན་དང་མཚུངས་པ་ཉིད་དུ་ཤེས་པས་སླར་མི་སྡིགས་མི་རྡེག་གོ། །
en: When threatened and beaten, they do not respond with threats and beatings due to the force of their understanding that they are like a reflected image.

source: གཤེ་ཡང་སེམས་སྒྱུ་མ་དང་མཚུངས་པ་ཉིད་དུ་ཤེས་པའི་སྟོབས་ཀྱིས་སླར་མི་གཤེའོ། །
en: When abused, they do not respond with abuse due to the force of their understanding that the mind is an illusion.

source: ཁྲོས་ཀྱང་ནང་རྣམ་པར་དག་པར་ཤེས་པའི་སྟོབས་ཀྱིས་སླར་མི་ཁྲོའོ། །
en: When they meet with anger, they do not respond with anger due to the force of their understanding of inner purity.

source: འཇིག་རྟེན་གྱི་ཆོས་རྣམ་པར་དག་པར་ཤེས་པའི་སྟོབས་ཀྱིས་འཇིག་རྟེན་གྱི་ཆོས་རྣམས་ཀྱིས་མི་འཕྲོགས་སོ། །
en: They are not seduced by worldly phenomena due to the force of their understanding that worldly phenomena are pure.

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་རྣམ་པར་དག་པར་ཤེས་པའི་སྟོབས་ཀྱིས་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་མི་རྫིའོ། །
en: They are not under the sway of any afflictive emotions due to the force of their understanding that dependent arising is pure.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ནི་འཁྲུག་པའི་སྒོ་ཇི་སྙེད་མཐོང་བར་རབ་ཏུ་ཞི་བའི་སྒོ་ཡང་དེ་སྙེད་དུ་མཐོང་སྟེ།
en: Thus, bodhisattvas see the gateway to peace wherever they see a gateway to agitation.

source: འདི་ནི་བཟོད་པའི་སྟོབས་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s strength of patience.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་སྟོབས་གང་ཞེ་ན།
en: “What is a bodhisattva’s strength of wisdom?

source: བྱང་ཆུབ་སེམས་དཔས་གང་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་ཤེས་པ་དེ་དག་ནི་སྟོང་པ། མ་སྐྱེས་པ། མ་འགགས་པའོ། །
en: To bodhisattvas, whatever knowledge there is about the aggregates, elements, or sense bases is empty, unarisen, and unceasing.

source: ཡེ་ཤེས་གང་གིས་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཡང་དག་པར་བསྒྲུབ་པ་དེ་ལས་མུ་སྟེགས་ཅན་དང་།
en: It is the wisdom through which the awakening of buddhahood is achieved.

source: དམིགས་པ་ཅན་ཐམས་ཅད་དང་། བདུད་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་གཟུགས་སུ་གནས་པས་ཀྱང་ཡེ་ཤེས་དེ་ལ་ཐེ་ཙོམ་ཟ་བར་བྱེད་མི་ནུས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཞེས་བྱའོ། །
en: No rival tradition, no one involved in apprehending things, nor any māra has the ability to sow doubts about it, even if they take the form of a buddha. This is known as a bodhisattva’s strength of wisdom.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤོང་བའི་སྟོབས་གང་ཞེ་ན།
en: “What is a bodhisattva’s strength of abandonment?

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་གནས་གཅིག་ན་གནས་པའི་གན་དུ་སེམས་ཅན་ཐམས་ཅད་ལྷགས་ཏེ་ཁ་ངན་ཟེར། མི་སྙན་པར་བརྗོད། ཚིག་བརླང་བ་རྩུབ་པོ་སྨྲ། སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་གྱི་མི་བསྔགས་པ་བརྗོད་ཀྱང་དེ་སེམས་ཅན་དེ་དག་ལ་མི་འཁྲུག་ཅིང་ཡིད་མི་བདེ་བར་མི་འགྱུར་རོ། །
en: If bodhisattvas were living in a certain place, and all the beings approached them and reviled them, defamed them, spoke harshly to them, or even debased the Buddha, Dharma, and Saṅgha, they would not be agitated by or be displeased with them.

source: འགྱོད་པར་མི་འགྱུར་རོ། །བག་ལ་ཉལ་བར་མི་བྱེད་དོ། །
en: They would not feel regret or develop a grudge.

source: ལུས་གཤགས་གཏུབས་ཀྱང་དེ་བཞིན་དུ་བག་ལ་ཉལ་མི་སྐྱེད་དོ། །
en: They would not develop a grudge even if their body was chopped into pieces.

source: སེམས་ཅན་དེ་དག་ཀྱང་དཀོན་མཆོག་གསུམ་ལ་རབ་ཏུ་འགོད་དེ།
en: Rather, they would establish those beings in the Three Jewels.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤོང་བའི་སྟོབས་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s strength of abandonment.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐོས་པའི་སྟོབས་གང་ཞེ་ན།
en: “What is a bodhisattva’s strength of learning?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་མང་དུ་ཐོས་པ། ཐོས་པ་འཛིན་པ། ཐོས་པ་རྒྱ་མཚོ། ཐོས་པ་བསགས་པ་ཡིན་ཏེ།
en: Bodhisattvas learn a lot, they retain what they learn, become oceans of learning, and accumulate learning.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐོས་པའི་སྟོབས་དེ་ལྟ་བུ་དང་ལྡན་པ་ཡིན་ནོ། །
en: Bodhisattvas are those who possess this kind of strength of learning.

source: གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཐེ་ཚོམ་བཟུང་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་གན་དུ་ལྷགས་ནས། གང་སེམས་ཅན་གཅིག་གི་འདྲི་བ་དེ་བཞིན་དུ་གཞན་མི་འདྲི་བར་ཐམས་ཅད་ཀྱིས་ཐེ་ཚོམ་ཐ་དད་པར་ལྷན་ཅིག་ཏུ་དྲིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཐགས་ཐོགས་མེད་པར་ལྷན་ཅིག་ཏུ་ལན་འདེབས་སོ། །
en: Even if every being in the trichiliocosm were to be beset with doubt and approached a bodhisattva, and if each of them asked a question none of the others had and which was attended by a unique doubt, the bodhisattva would instantly answer without the slightest hesitation.

source: བསྐལ་པ་བརྒྱ་སྟོང་དུ་དྲིས་ཀྱང་དེ་བཞིན་དུ་ལུང་སྟོན་ཏེ།
en: Even if that bodhisattva were questioned for a hundred or a thousand eons, they would speak as needed.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐོས་པའི་སྟོབས་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s strength of learning.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤོབས་པའི་སྟོབས་གང་ཞེ་ན།
en: “What is a bodhisattva’s strength of confident eloquence?

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མའི་ནང་དུ་ཆོས་སྟོན་ན། དེ་མི་སེམས་མི་རྟོག་པར་སེམས་ཅན་གང་དང་གང་གི་འདོད་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་སྟོན་ཅིང་ཐོགས་པར་བྱེད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་སྟོན་པ་དེ་དོན་ཉམས་པར་མི་འགྱུར།
en: Were a bodhisattva to teach the Dharma to and advance the learning of an audience of many millions upon billions, that bodhisattva would teach the Dharma according to the needs of each being without thinking or conceptualizing.

source: ཚིག་འབྲུ་ཉམས་པར་མི་འགྱུར། ཚིག་ཟློས་པར་མི་འགྱུར།
en: Even then, the meaning of the Dharma they taught would not be lost, not a word would be lost, they would not repeat a single word, there would be no obstacles, and the teaching would not be disrupted.

source: ཐོགས་པར་མི་འགྱུར། གཅོད་པར་མི་འགྱུར་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤོབས་པའི་སྟོབས་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s strength of confident eloquence.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་ཀྱི་སྟོབས་གང་ཞེ་ན། གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ཤིང་དྲུང་ན་གནས་ཀྱང་རུང་།
en: “What is a bodhisattva’s strength of merit?

source: གཙུག་ལག་ཁང་ན་གནས་ཀྱང་རུང་། ཁྱིམ་སྟོང་པ་ན་གནས་ཀྱང་རུང་། བདུད་ཐམས་ཅད་འཁོར་དང་བཅས་ཏེ་ལྷགས་ནས་བགེགས་བྱ་བ་དང་། གཙེ་བའི་ཕྱིར་ནན་ཏན་བྱེད་ན། དེ་ལ་བདུད་དེ་དག་བདག་ཉིད་འཇིགས་སྐྲག་མྱོས་ཤིང་གྱེས་ཏེ།
en: Whether a bodhisattva lives beneath a tree, in a monastery, or in an empty house, all māras and their hosts who approach and assault them in order to create obstacles and cause harm will instead be driven mad with fear and disperse.

source: བདག་མགོན་མེད་པར་ཤེས་ནས་འབྲོས་པར་འགྱུར་རོ། །གང་བདུད་དེ་དག་གི་རལ་གྲི་དང་མཚོན་རྩེ་གཉིས་པ་དང་།
en: They know that they are helpless and flee.

source: མདུང་རྩེ་གསུམ་པ་དང་། རྡོ་བ་དང་སྟ་རེ་འབབ་པ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་མན་དཱ་ར་བའི་མེ་ཏོག་དང་། ཙམ་པ་ཀ་དང་སྣ་མའི་མེ་ཏོག་དང་། ཨུཏྤ་ལ་དང་པད་མར་གྱུར་ནས་འབབ་བོ། །གང་བདུད་དེ་དག་གི་ཚིག་རྩུབ་པོ་དང་།
en: The fall of their blades, spears, tridents, stones, and axes will become, through the blessings of the bodhisattva’s merit, a fall of mandārava flowers, campaka flowers, and jasmine flowers, water lilies and lotuses, and the māras’ rough, harsh words will sound like praise to the bodhisattva.

source: ཚིག་བརླང་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ་བསྟོད་པར་གྲག་གོ། །བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་ནམ་ཡང་ཡིད་དུ་མི་འོང་བའི་ཡུལ་དྲུག་སྣང་བར་མི་འགྱུར་རོ། །བསམས་པ་ཙམ་གྱིས་དེའི་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ནམ་མཁའ་ལས་འབྱུང་ངོ་། །
en: The six sense objects never appear unpleasant to the bodhisattva, and all manner of wondrous things spring from space with just a thought.

source: དེ་ཡང་དེའི་རང་གི་བསོད་ནམས་ཀྱི་དབང་གིས་ནམ་མཁའི་མཛོད་དང་། ལག་ན་རིན་པོ་ཆེ་ལས་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་འབྱུང་སྟེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཚོ་བར་འགྱུར་རོ། །
en: Through the power of a bodhisattva’s merit, all manner of wondrous things spring from the sky treasury and the jewel-in-hand, so that they become a support for all beings.

source: དེའི་རང་གི་བསོད་ནམས་ཀྱི་དབང་ལག་ན་རིན་པོ་ཆེ་དེ་ནི་ཚེའི་ཚད་བསྐལ་པར་གནས་ཏེ་བརྗོད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་ཀྱི་སྟོབས་ཀྱི་མཐའ་རྟོགས་པར་སླ་བ་མ་ཡིན་ཏེ།
en: Through the power of their merit, the jewel-in-hand lasts for the eons that constitute their lives, but even saying this does not easily capture the full extent of the strength of a bodhisattva’s merit.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་ཀྱི་སྟོབས་ཞེས་བྱའོ། །
en: This is what is known as a bodhisattva’s strength of merit.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྒྲུབ་པའི་སྟོབས་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའི་སྒྲུབ་པའི་སྟོབས་ནི་རྣམ་པ་བཅུའོ། །རྣམ་པ་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is a bodhisattva’s strength of practice?

source: སྦྱིན་པ་སྒྲུབ་པ་དང་། ཚུལ་ཁྲིམས་སྒྲུབ་པ་དང་། བཟོད་པ་སྒྲུབ་པ་དང་། བརྩོན་འགྲུས་སྒྲུབ་པ་དང་། བསམ་གཏན་སྒྲུབ་པ་དང་། ཤེས་རབ་སྒྲུབ་པ་དང་།
en: A bodhisattva’s strength of practice has ten types: the practice of generosity, discipline, patience, diligence, meditative stability, insight, skillful means, aspiration, strength, and wisdom.

source: ཐབས་སྒྲུབ་པ་དང་། སྨོན་ལམ་སྒྲུབ་པ་དང་། སྟོབས་སྒྲུབ་པ་དང་། ཡེ་ཤེས་སྒྲུབ་པ་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྒྲུབ་པ་རྣམ་པ་བཅུ་ཞེས་བྱའོ། །
en: These are known as a bodhisattva’s ten types of practice.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་སྒྲུབ་པ་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ནི་སྒྲུབ་པ་བཅུ་པོ་འདིའི་ནང་དུ་འདུས་པར་བལྟའོ། །
en: Any of a bodhisattva’s practices that involve the perfections should be included among these ten practices.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པ་སྒྲུབ་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s practice of generosity?

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་སྦྱིན་པའི་ཆོས་གང་གིས་སེམས་ཅན་རྣམས་ལ་གནོད་པར་འགྱུར་བ་མ་གཏོགས་པར་སེམས་ཅན་རྣམས་ལ་མི་སྦྱིན་པ་གང་ཡང་མེད་དོ། །
en: There is no object of generosity that a bodhisattva should not offer to beings, apart from that which will cause beings harm.

source: བྱང་ཆུབ་སེམས་དཔའི་སེམས་གང་གིས་སྦྱིན་པ་བྱིན་པའི་སེམས་དེ་ལ་ནི་དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་ཐོབ་པ་མ་གཏོགས་པར་སེམས་ཅན་གཞན་རྣམས་ཀྱིས་དད་པར་སླ་བ་ཡང་མ་ཡིན་ན། ཤེས་པར་འགྱུར་བ་ལྟ་ཅི་སྨོས་ཏེ།
en: The mind of a bodhisattva giving generously is not easy to trust, much less understand, by anyone other than thus-gone ones and bodhisattvas who have attained acceptance.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པ་སྒྲུབ་པ་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s practice of generosity.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་སྒྲུབ་པ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་སྒྲུབ་པ་ནི་རྣམ་པ་བཅུའོ། །རྣམ་པ་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཉན་ཐོས་ཀྱི་སྡོམ་པའི་ཚུལ་ཁྲིམས་སྒྲུབ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་སྡོམ་པའི་ཚུལ་ཁྲིམས་སྒྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྡོམ་པའི་ཚུལ་ཁྲིམས་སྒྲུབ་པ་དང་། དགེ་བའི་ཆོས་ཐམས་ཅད་སྡུད་པའི་ཚུལ་ཁྲིམས་སྒྲུབ་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ཀུན་ཏུ་ཚོལ་བ་མི་གཏོང་བའི་སྡོམ་པའི་ཚུལ་ཁྲིམས་སྒྲུབ་པ་དང་།
en: “What is a bodhisattva’s practice of discipline?

source: དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའི་སྡོམ་པའི་ཚུལ་ཁྲིམས་སྒྲུབ་པ་དང་། རྟག་ཏུ་གཞན་གྱི་དོན་སྒྲུབ་པའི་སྡོམ་པའི་ཚུལ་ཁྲིམས་སྒྲུབ་པ་དང་། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བའི་སྡོམ་པའི་ཚུལ་ཁྲིམས་སྒྲུབ་པ་དང་། རྟག་ཏུ་མཉམ་པར་བཞག་པའི་སྡོམ་པའི་ཚུལ་ཁྲིམས་སྒྲུབ་པ་དང་། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཡང་དག་པར་འཇོམས་པ་ལ་བཟོད་པའི་སྡོམ་པའི་ཚུལ་ཁྲིམས་སྒྲུབ་པའོ། །
en: A bodhisattva’s practice of discipline has ten types: they practice the discipline of the śrāvaka vows, the discipline of the pratyekabuddha vows, the discipline of the bodhisattva vows, the discipline that includes all virtuous dharmas, the discipline of not giving up the search for a spiritual friend, the discipline of vowing to uphold the sublime Dharma, the discipline of vowing to always fulfill the aims of others, the discipline of vowing to ripen to awakening, the discipline of vowing to always remain in meditative composure, and the discipline of vowing to be patient in overcoming the nexus of habitual patterns.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་རྣམ་པར་མི་རྟོག་པའི་ཚུལ་ཁྲིམས་ཅན་ཡིན་ཏེ།
en: Bodhisattvas possess nonconceptual discipline.

source: དེ་དག་གི་ཚུལ་ཁྲིམས་སྒྲུབ་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་མ་ཡིན་པ་རྣམས་ཀྱིས་ཤེས་པར་སླ་བ་མ་ཡིན་ཏེ།
en: The practice of their discipline is not easy to understand for anyone but the omniscient.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་སྒྲུབ་པ་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s practice of discipline.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་སྒྲུབ་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s practice of patience?

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཟོད་པ་སྒྲུབ་པ་ནི་རྣམ་པ་གསུམ་མོ། །རྣམ་པ་གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྡུག་བསྔལ་དང་དུ་ལེན་པའི་བཟོད་པ་དང་། གཞན་གྱིས་གནོད་པར་བྱས་པ་ལ་མི་མཇེད་པའི་བཟོད་པ་དང་།
en: A bodhisattva’s practice of patience has three types: the patience of enduring suffering, the patience of tolerating the harm inflicted by others, and the patience of comprehending phenomena.The patience of enduring suffering refers to acting with the knowledge that suffering is the result of one’s own karma.

source: ཆོས་ལ་ངེས་པར་སེམས་པའི་བཟོད་པའོ། །དེ་ལ་སྡུག་བསྔལ་དང་དུ་ལེན་པའི་བཟོད་པ་ནི་ལས་བདག་གིར་བྱ་བ་ཤེས་པ་ལ་འཇུག་པའོ། །གཞན་གྱིས་གནོད་པར་བྱས་པ་ལ་མི་མཇེད་པའི་བཟོད་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་བུ་གཅིག་པ་བཞིན་དུ་བྱམས་པ་ལ་འཇུག་པའོ། །
en: The patience of tolerating the harm inflicted by others refers to acting with love toward all beings, as if they were one’s only child.

source: ཆོས་ལ་ངེས་པར་སེམས་པའི་བཟོད་པ་ནི་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པར་ཤེས་པ་ལ་འཇུག་པ་སྟེ།
en: The patience of comprehending phenomena refers to acting with the knowledge that all phenomena are unarisen.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་རྣམ་པ་གསུམ་ཞེས་བྱའོ། །
en: These are the three types of a bodhisattva’s patience.

source: གང་བཟོད་པ་འདི་དག་སྒྲུབ་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་སྒྲུབ་པ་ཞེས་བྱའོ། །
en: The practice of these types of patience is known as a bodhisattva’s practice of patience.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་སྒྲུབ་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s practice of diligence?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་དང་གང་དུ་ཇི་ལྟ་ཇི་ལྟར་དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་འགྲུབ་པར་བྱ་བའི་ཕྱིར་སྦྱོར་བ་དེ་དང་དེར་འདུ་ཤེས་འདི་ལྟར་སྦྱོར་ཏེ།
en: In order to accomplish virtuous qualities in any situation and in any way, they apply the following perspective when engaged in the relevant practice: ‘I will accomplish this virtuous quality for all beings.’

source: བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་ཆོས་འདི་ཡོངས་སུ་བསྒྲུབ་པར་བྱའོ་སྙམ་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་སྒྲུབ་པ་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s practice of diligence.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་སྒྲུབ་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s practice of meditative stability?

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་མཉམ་པར་མ་བཞག་པའི་ཆོས་གང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: Bodhisattvas do not apprehend any phenomena that are not in a state of meditative composure.

source: དེ་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྙོམས་པར་ཞུགས་པ།
en: For them, all phenomena are naturally in a state of equipoise.

source: ཞི་བ་སེམས་དང་ཡིད་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་དང་བྲལ་བ། མ་སྐྱེས་མ་འགགས་ཤིང་མི་གཡོ་བ་ཐོབ་པར་མཐོང་ངོ་། །
en: Bodhisattvas are at peace, free from the mind and the mind consciousness, and experience the attainment that is unarisen, unceasing, and unwavering.

source: དེ་བདག་ནི་མཉམ་པར་བཞག་པ། གཞན་ནི་རྣམ་པར་གཡེངས་པའོ་སྙམ་དུ་མི་སེམས་སོ། །
en: They do not think, ‘I have meditative composure; others are distracted.’

source: བདག་དང་གཞན་ལས་རྣམ་པར་གྲོལ་བའི་ཏིང་ངེ་འཛིན་གཞན་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ལ།
en: They do not apprehend another samādhi that liberates from self and other.

source: བྱང་ཆུབ་ཡང་དག་པར་སྒྲུབ་པའི་བརྩོན་འགྲུས་ཀྱང་མི་ཉམས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་སྒྲུབ་པའོ། །
en: This undiminished diligence for accomplishing awakening is a bodhisattva’s practice of meditative stability.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་སྒྲུབ་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s practice of insight?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལས་རྣམ་པར་གྲོལ་བ་དང་། གང་སྟོང་པ་ཉིད་ལས་རྣམ་པར་གྲོལ་བ་དང་། གང་མཚན་མ་མེད་པ་ལས་རྣམ་པར་གྲོལ་བ་དང་། གང་སྨོན་པ་མེད་པ་ལས་རྣམ་པར་གྲོལ་བ་དང་། གང་ནམ་མཁའ་ལས་རྣམ་པར་གྲོལ་བའི་ཆོས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ལ།
en: They do not apprehend any phenomena that fall outside the scope of dependent arising, or of emptiness, signlessness, and wishlessness, or that fall outside the scope of space.

source: བྱང་ཆུབ་ཀྱི་ལམ་དང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་བརྩོན་འགྲུས་ཀྱང་མི་ཉམས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་སྒྲུབ་པའོ། །
en: This undiminished diligence for awakening and ripening beings is a bodhisattva’s practice of insight.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་སྒྲུབ་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s practice of skillful means?

source: གང་བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་ཀྱང་མི་དམིགས་ལ་རྟག་ཏུ་བདག་ཉིད་ཀྱིས་སྦེད་པ་ཡང་སྤྱོད་དོ། །
en: It is that mode of conduct in which they themselves continually protect themselves while not conceptually fixating on a self.

source: སེམས་ཅན་ཡང་མི་དམིགས་ལ་རྟག་ཏུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་བརྩོན་པ་ཡང་སྤྱོད་དོ། །
en: It is their continuous efforts to ripen beings while not conceptually fixating on beings.

source: ཉོན་མོངས་པ་ཡང་མི་དམིགས་ལ་རྟག་ཏུ་དབང་པོ་རྣམས་སྦེད་པ་ཡང་སྤྱོད་དོ། །
en: It is their continual guarding of the senses while not conceptually fixating on the afflictive emotions.

source: དེ་ལ་གང་སངས་རྒྱས་ཀྱི་གཟུགས་མ་ཡིན་པའི་གཟུགས་ཅུང་ཟད་ཀྱང་སྣང་བར་མི་འགྱུར་ལ་རྟག་ཏུ་སངས་རྒྱས་མཐོང་བར་འདོད་པ་ཡང་ཡིན་ནོ། །
en: Though forms that are not even slightly different than a buddha’s form do not appear to them, they continually wish to see a buddha.

source: དེ་ལ་གང་ཆོས་ཀྱི་སྒྲ་མ་ཡིན་པའི་སྒྲ་གང་ཡང་གྲག་པར་མི་འགྱུར་ལ་རྟག་ཏུ་ཆོས་ཉན་པས་ངོམས་མི་མྱོང་བ་ཡང་ཡིན་ནོ། །
en: Though sounds that are not sounds of the Dharma do not ring out to them, they are continually unsatiated by the Dharma they hear.

source: འཁོར་བ་ཡང་མི་དམིགས་ལ་རྟག་ཏུ་འཁོར་བས་འཇིགས་པའི་ཡིད་དང་ལྡན་པ་ཡང་ཡིན་ནོ། །
en: They do not conceptually fixate on saṃsāra, but continually fear saṃsāra.

source: མྱ་ངན་ལས་འདས་པ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ལ་མྱ་ངན་ལས་འདས་པ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བར་ཡང་བྱེད་དོ། །
en: They do not conceptually fixate on nirvāṇa, but they give away all their wealth in order to realize nirvāṇa.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་ཀྱང་མི་དམིགས་ལ་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་བརྒྱ་སྟོང་མང་པོ་ཡང་མངོན་པར་སྒྲུབ་སྟེ།
en: They do not conceptually fixate on the Buddha or awakening, but they strive to make hundreds of thousands of aspirations to realize the awakening of buddhahood.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་སྒྲུབ་པ་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s practice of skillful means.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་སྒྲུབ་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s practice of aspiration?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་གང་ཡང་འབྲི་བའམ་འཕེལ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་རྣམས་ལ་ཡང་རྗེས་སུ་ཡི་རང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྔོ་བར་བྱེད་དོ། །
en: Bodhisattvas do not observe any phenomena that decrease or increase, and yet they rejoice in the roots of virtue of all beings and dedicate them to unsurpassable, completely perfect awakening.

source: རང་གི་དགེ་བའི་རྩ་བ་རྣམས་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ནས་འདིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: They first share their own roots of virtue with all beings, and then dedicate them to unsurpassable, completely perfect awakening by saying, ‘May I perfectly and completely awaken to unsurpassable, completely perfect awakening.

source: བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་འདྲ་བར་གྱུར་ཅིག །
en: May my buddhafield be like this.

source: འཁོར་ཕུན་སུམ་ཚོགས་པ་ནི་འདི་འདྲ་བར་གྱུར་ཅིག་ཅེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བར་བྱེད་དོ། །
en: May my perfect assembly be like that.’

source: དེའི་སྨོན་ལམ་དེ་ཡང་ཡང་དག་པར་འགྲུབ་པ་སྟེ་མི་འགྲུབ་པར་མི་འགྱུར་རོ། །
en: These aspirations of theirs will be perfectly fulfilled; they will not go unfulfilled.

source: དེ་ཚུལ་ཁྲིམས་མ་ཞིག་པ། མ་ཉམས་པ། འདྲེན་མ་མ་ཡིན་པ། སྲ་སྲེར་མ་གྱུར་པ།
en: Their discipline will not be broken, weaken, break down, or be contaminated.

source: མཁས་པས་བསྔགས་པ་བསྲུང་ངོ་། །
en: It will be praised and protected by the wise.

source: དེ་ཚུལ་ཁྲིམས་དེ་ལ་རབ་ཏུ་གནས་པས་སེམས་ཀྱིས་སྨོན་པ་འགྲུབ་པར་འགྱུར་ཏེ།
en: Bodhisattvas mentally fulfill their aspirations by maintaining this discipline.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་སྒྲུབ་པ་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s practice of aspiration.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་སྒྲུབ་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s practice of strength?

source: གལ་ཏེ་ལ་ལ་ཞིག་སངས་རྒྱས་ཀྱི་གཟུགས་སུ་བསྒྱུར་ནས་བྱང་ཆུབ་སེམས་དཔའི་གན་དུ་འོངས་ཏེ། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལས་ཟློག་པར་བྱེད། འདུན་པ་ཟློག་པར་བྱེད། དབྲལ་བར་བྱེད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དེ་འདུན་པ་ལྡོག་པར་མི་འགྱུར་ཏེ། བྱང་ཆུབ་ཉིད་རྗེས་སུ་དྲན་ནོ། །
en: Even if someone were to take the form of a buddha and then approach a bodhisattva and try to turn them away from awakening to buddhahood, turn them away from their intention, and to separate them from it, the bodhisattva would not turn away from their intention.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་རྗེས་སུ་དྲན་ནོ། །བདུད་འདུལ་བ་དང་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་དང་། སྙིང་རྗེ་ཆེན་པོ་མངོན་དུ་བྱེད་པའོ། །
en: They would call to mind awakening and the seat of awakening, and would actualize the taming of Māra, turning the wheel of Dharma, and the experience of great compassion.

source: སེམས་ཅན་གང་བྱང་ཆུབ་སེམས་དཔའ་དེ་འདུན་པ་ཟློག་པར་བྱེད། དབྲལ་བར་བྱེད། རྣམ་པར་ཟློག་པར་བྱེད་ན། སེམས་ཅན་དེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཁོང་ཁྲོ་བར་མི་འགྱུར་གྱི།
en: Bodhisattvas will not get angry even when beings try to turn them away from their intention, separate them from it, or reverse their course.

source: སེམས་ཅན་དེ་ལ་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་དེ།
en: Instead, they will feel great love and great compassion for them.

source: དད་པ་དང་བརྩོན་འགྲུས་དང་དྲན་པ་དང་ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་ཀྱི་སྟོབས་ལས་ཀྱང་མི་ཉམས་ཏེ།
en: The strength of their faith, diligence, mindfulness, and samādhi will not falter.

source: དེའི་ཕྱིར་མི་ལྡོག་པའི་སྟོབས་དེས་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལ་རབ་ཏུ་འགོད་རབ་ཏུ་འཛུད་དེ།
en: Therefore, due to the strength of such irreversibility, they will set and establish an infinite, incalculable number of beings in the awakening of buddhahood.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་སྒྲུབ་པ་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s practice of strength.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་སྒྲུབ་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s practice of wisdom?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདི་ལ་སྐྱེ་བའམ། འཆི་བའམ། རྒ་བ་གང་ཡང་མེད་དོ། །
en: Bodhisattvas think, ‘There is no birth, death, or old age here.

source: འདི་དག་ནི་ཆོས་ཙམ་དུ་ཟད་དེ།
en: These are just the way of phenomena.

source: བདག་དང་བདག་གི་དང་བྲལ་བའོ་ཞེས་ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: They are free of “I” and “mine.” ’ Thinking this, they perfectly understand exactly how things are.

source: དེ་ཡེ་ཤེས་ཀྱི་སྟོབས་དེ་ཉིད་ཀྱིས་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ཡེ་ཤེས་ཀྱི་སྟོབས་དེ་ལ་རབ་ཏུ་འགོད་དོ། །
en: Through exactly this strength of wisdom they establish an infinite, incalculable number of beings in that strength of wisdom.

source: དེ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཆོས་ཉིད་དེ་ལས་རྣམ་པར་བཟློག་ནས་འཇིག་རྟེན་གྱི་ཆོས་རྣམས་ལ་རབ་ཏུ་འཇོག་མི་ནུས་ཏེ།
en: No being has the capacity to turn them away from this basic reality and set them in worldly ways.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་སྒྲུབ་པའོ། །
en: This is known as a bodhisattva’s practice of wisdom.

source: འདི་ནི་སྒྲུབ་པ་རྣམ་པ་བཅུ་སྟེ།
en: “These are the ten types of practices.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་བཅུ་ཞེས་བྱའོ། །
en: This concludes the ten strengths of a bodhisattva.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་པ་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྡུག་བསྔལ་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་དང་། འགོག་པ་ཤེས་པ་དང་། ལམ་ཤེས་པ་དང་།
en: “What are a bodhisattva’s ten types of knowledge?

source: སྡུག་བསྔལ་ལ་ཆོས་ཤེས་ཤིང་ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་ལམ་ལ་ཆོས་ཤེས་པ་དང་ཕུང་པོ་ཤེས་པ་དང་། ཁམས་ཤེས་པ་དང་སྐྱེ་མཆེད་ཤེས་པ་དང་། འདས་པ་དང་མ་འོངས་པ་ཤེས་པ་དང་། ལམ་དང་འབྲས་བུ་ཤེས་པ་སྟེ།
en: Knowledge of suffering; knowledge of the origin; knowledge of cessation; knowledge of the path; knowledge of the phenomena associated with suffering, its origin, its cessation, and the path; knowledge of the aggregates; knowledge of the elements; knowledge of the sense bases; knowledge of the past and future; and knowledge of the path and its results.
